## sso_proxy
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 2 to change, 1 to destroy
```
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.pomerium_sso_proxy will be updated in-place
  ~ resource "aws_ecs_service" "pomerium_sso_proxy" {
        id                                 = "arn:aws:ecs:ca-central-1:794722365809:service/sso_proxy/pomerium_sso_proxy"
        name                               = "pomerium_sso_proxy"
        tags                               = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-sso-proxy"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:794722365809:task-definition/pomerium_sso_proxy:129" -> (known after apply)
        # (15 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.pomerium_sso_proxy must be replaced
-/+ resource "aws_ecs_task_definition" "pomerium_sso_proxy" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:794722365809:task-definition/pomerium_sso_proxy:129" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - cpu              = 0 -> null
                  ~ environment      = [
                        # (6 unchanged elements hidden)
                        {
                            name  = "LOG_LEVEL"
                            value = "debug"
                        },
                      ~ {
                            name  = "ROUTES"
                          ~ value = "LSBmcm9tOiBodHRwczovL2F1dGguc2VjdXJpdHkuY2Rzc2FuZGJveC54eXoKICB0bzogaHR0cDovL2F1dGguNzk0NzIyMzY1ODA5LmxvY2FsOjgwMDAKICBwb2xpY3k6CiAgICAtIGFsbG93OgogICAgICAgIG9yOgogICAgICAgICAgLSBkb21haW46CiAgICAgICAgICAgICAgaXM6IHNlY3VyaXR5LmNkc3NhbmRib3gueHl6CiAgY29yc19hbGxvd19wcmVmbGlnaHQ6IHRydWUKICB0aW1lb3V0OiAzMHMKCi0gZnJvbTogaHR0cHM6Ly9uZW80ai5zZWN1cml0eS5jZHNzYW5kYm94Lnh5egogIHRvOiBodHRwOi8vY2FydG9ncmFwaHktZjA5YTM1MGRlMWEyZTg5MC5lbGIuY2EtY2VudHJhbC0xLmFtYXpvbmF3cy5jb206NzQ3NAogIGFsbG93X3dlYnNvY2tldHM6IHRydWUKICBwcmVzZXJ2ZV9ob3N0X2hlYWRlcjogdHJ1ZQogIGNvcnNfYWxsb3dfcHJlZmxpZ2h0OiB0cnVlCiAgcG9saWN5OgogICAgICAtIGFsbG93OgogICAgICAgICAgb3I6CiAgICAgICAgICAgIC0gZG9tYWluOgogICAgICAgICAgICAgICAgaXM6IGNkcy1zbmMuY2EKCi0gZnJvbTogaHR0cHM6Ly9ib2x0LnNlY3VyaXR5LmNkc3NhbmRib3gueHl6CiAgdG86IGh0dHA6Ly9jYXJ0b2dyYXBoeS1mMDlhMzUwZGUxYTJlODkwLmVsYi5jYS1jZW50cmFsLTEuYW1hem9uYXdzLmNvbTo3Njg3CiAgYWxsb3dfd2Vic29ja2V0czogdHJ1ZQogIHByZXNlcnZlX2hvc3RfaGVhZGVyOiB0cnVlCiAgY29yc19hbGxvd19wcmVmbGlnaHQ6IHRydWUKICBzZXRfcmVzcG9uc2VfaGVhZGVyczoKICAgIEFjY2Vzcy1Db250cm9sLUFsbG93LU9yaWdpbjogaHR0cHM6Ly9uZW80ai5zZWN1cml0eS5jZHNzYW5kYm94Lnh5egogIHBvbGljeToKICAgICAgLSBhbGxvdzoKICAgICAgICAgIG9yOgogICAgICAgICAgICAtIGRvbWFpbjoKICAgICAgICAgICAgICAgIGlzOiBjZHMtc25jLmNhCgotIGZyb206IGh0dHBzOi8vY3NwLXJlcG9ydHMuc2VjdXJpdHkuY2Rzc2FuZGJveC54eXoKICB0bzogaHR0cDovL2ludGVybmFsLWNzcC1yZXBvcnRzLTYyMTA1NjQ3LmNhLWNlbnRyYWwtMS5lbGIuYW1hem9uYXdzLmNvbTo4MDAwCiAgcHJlc2VydmVfaG9zdF9oZWFkZXI6IHRydWUKICBwb2xpY3k6CiAgICAgIC0gYWxsb3c6CiAgICAgICAgICBvcjoKICAgICAgICAgICAgLSBkb21haW46CiAgICAgICAgICAgICAgICBpczogY2RzLXNuYy5jYQoKLSBmcm9tOiBodHRwczovL2NzcC1yZXBvcnQtdG8uc2VjdXJpdHkuY2Rzc2FuZGJveC54eXoKICB0bzogaHR0cDovL2ludGVybmFsLWNzcC1yZXBvcnRzLTYyMTA1NjQ3LmNhLWNlbnRyYWwtMS5lbGIuYW1hem9uYXdzLmNvbTo4MDAwCiAgcHJlc2VydmVfaG9zdF9oZWFkZXI6IHRydWUKICBjb3JzX2FsbG93X3ByZWZsaWdodDogdHJ1ZQogIHBvbGljeToKICAgICAgLSBhbGxvdzoKICAgICAgICAgIG9yOgogICAgICAgICAgICAtIGh0dHBfbWV0aG9kOgogICAgICAgICAgICAgICAgaXM6IFBPU1QKICAgICAgICAgICAgLSBodHRwX21ldGhvZDoKICAgICAgICAgICAgICAgIGlzOiBQVVQKICAgICAgICAgIGFuZDoKICAgICAgICAgICAgLSBodHRwX3BhdGg6CiAgICAgICAgICAgICAgICBpczogL3JlcG9ydA==" -> "LSBmcm9tOiBodHRwczovL2F1dGguc2VjdXJpdHkuY2Rzc2FuZGJveC54eXoKICB0bzogaHR0cDovL2F1dGguNzk0NzIyMzY1ODA5LmxvY2FsOjgwMDAKICBwb2xpY3k6CiAgICAtIGFsbG93OgogICAgICAgIG9yOgogICAgICAgICAgLSBkb21haW46CiAgICAgICAgICAgICAgaXM6IHNlY3VyaXR5LmNkc3NhbmRib3gueHl6CiAgY29yc19hbGxvd19wcmVmbGlnaHQ6IHRydWUKICB0aW1lb3V0OiAzMHMKCi0gZnJvbTogaHR0cHM6Ly9jc3AtcmVwb3J0cy5zZWN1cml0eS5jZHNzYW5kYm94Lnh5egogIHRvOiBodHRwOi8vaW50ZXJuYWwtY3NwLXJlcG9ydHMtNjIxMDU2NDcuY2EtY2VudHJhbC0xLmVsYi5hbWF6b25hd3MuY29tOjgwMDAKICBwcmVzZXJ2ZV9ob3N0X2hlYWRlcjogdHJ1ZQogIHBvbGljeToKICAgICAgLSBhbGxvdzoKICAgICAgICAgIG9yOgogICAgICAgICAgICAtIGRvbWFpbjoKICAgICAgICAgICAgICAgIGlzOiBjZHMtc25jLmNhCgotIGZyb206IGh0dHBzOi8vY3NwLXJlcG9ydC10by5zZWN1cml0eS5jZHNzYW5kYm94Lnh5egogIHRvOiBodHRwOi8vaW50ZXJuYWwtY3NwLXJlcG9ydHMtNjIxMDU2NDcuY2EtY2VudHJhbC0xLmVsYi5hbWF6b25hd3MuY29tOjgwMDAKICBwcmVzZXJ2ZV9ob3N0X2hlYWRlcjogdHJ1ZQogIGNvcnNfYWxsb3dfcHJlZmxpZ2h0OiB0cnVlCiAgcG9saWN5OgogICAgICAtIGFsbG93OgogICAgICAgICAgb3I6CiAgICAgICAgICAgIC0gaHR0cF9tZXRob2Q6CiAgICAgICAgICAgICAgICBpczogUE9TVAogICAgICAgICAgICAtIGh0dHBfbWV0aG9kOgogICAgICAgICAgICAgICAgaXM6IFBVVAogICAgICAgICAgYW5kOgogICAgICAgICAgICAtIGh0dHBfcGF0aDoKICAgICAgICAgICAgICAgIGlzOiAvcmVwb3J0"
                        },
                    ]
                  - mountPoints      = [] -> null
                    name             = "pomerium_sso_proxy"
                  - volumesFrom      = [] -> null
                    # (5 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "pomerium_sso_proxy" -> (known after apply)
      ~ revision                 = 129 -> (known after apply)
        tags                     = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-sso-proxy"
            "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_security_group.pomerium will be updated in-place
  ~ resource "aws_security_group" "pomerium" {
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/24",
                  - "10.0.1.0/24",
                  - "10.0.2.0/24",
                ]
              - description      = "Outbound access to neo4j bolt"
              - from_port        = 7687
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = true
              - to_port          = 7687
            },
          - {
              - cidr_blocks      = [
                  - "10.0.0.0/24",
                  - "10.0.1.0/24",
                  - "10.0.2.0/24",
                ]
              - description      = "Outbound access to neo4j http"
              - from_port        = 7474
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = true
              - to_port          = 7474
            },
          - {
              - cidr_blocks      = [
                  - "10.0.8.0/22",
                ]
              - description      = "Access Cartography cidr"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 65535
            },
            # (5 unchanged elements hidden)
        ]
        id                     = "sg-09a0a4b0cfb0c180f"
        name                   = "pomerium"
        tags                   = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-sso-proxy"
            "Terraform"  = "true"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
